# 5 Ways to Create a Data Frame
* Read CSV File
* Use Numpy Arrays
* Create Empty DF
* Concatinate 2 DFs
* Dictionaries

## 1st Read a CSV File
Optional read an Excel File

In [1]:
# Import Library os - Operating System interface
from os import listdir
from os.path import isfile, join
import pandas as pd
import numpy as np


df = pd.read_csv("data.csv")

In [4]:
df.describe()

            Period    Data_value  Magnitude  Series_title_5
count  6195.000000   5720.000000     6195.0             0.0
mean   2019.093908   4763.275446        6.0             NaN
std       1.889761   6994.801557        0.0             NaN
min    2016.060000   -398.194000        6.0             NaN
25%    2017.120000    651.571500        6.0             NaN
50%    2019.090000   2104.630500        6.0             NaN
75%    2021.030000   4501.160250        6.0             NaN
max    2022.090000  38858.407000        6.0             NaN

## 2nd Create DF with Numpy Arrays

In [7]:
array = np.array([[15, "Mike", "Pupil"], [32, "Jules", "Author"], [36, "Peter", "Physician"]])

column_index = ["Age", "Name", "Profession"]
row_index = ["Kid", "Mother", "Father"]

df_02 = pd.DataFrame(data = array, index = row_index, columns = column_index)

## 3rd Create Empty Data Frame

In [10]:
#Preparation
list_myWords = ["Hello World","Also a longer sentence", "One more Word", "Python"]

columns = ["Filename", "Language"]

for word in list_myWords:
    columns.append(word)
    columns.append(word + "_Page")

In [11]:
columns

['Filename',
 'Language',
 'Hello World',
 'Hello World_Page',
 'Also a longer sentence',
 'Also a longer sentence_Page',
 'One more Word',
 'One more Word_Page',
 'Python',
 'Python_Page']

In [12]:
no_of_row = 5
no_of_cols = len(columns)

In [13]:
df = pd.DataFrame(0, index = range(no_of_row), columns = range(no_of_cols))
df.columns = columns

In [15]:
df.iloc[1,3] = 4711

In [16]:
df

,Filename,Language,Hello World,Hello World_Page,Also a longer sentence,Also a longer sentence_Page,One more Word,One more Word_Page,Python,Python_Page
0,0,0,0,0,0,0,0,0,0,0
1,0,0,0,4711,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0

## 4th Concatinate Two Data Frames

In [25]:
array = np.array([[98, "Maria", "Teacher"], [102, "Martin", "Soldier"], [87, "Marry", "Physician"]])

column_values = ['Age', 'Name', 'Profession']
index_values = ["Grandmother","Grandfather","Aunt"]

df_03 = pd.DataFrame(data = array, index = index_values,  columns = column_values)

In [26]:
result = pd.concat([df_02, df_03])

In [27]:
result

             Age    Name Profession
Kid           15    Mike      Pupil
Mother        32   Jules     Author
Father        36   Peter  Physician
Grandmother   98   Maria    Teacher
Grandfather  102  Martin    Soldier
Aunt          87   Marry  Physician

## 5th Create Data Frame with Dictionaries

In [28]:
data = { "Name" : ["Sabine", "Peter", "Lars", "Jules"],
        "Age" : [22,16, 21, 18],
        "Subject" : ["Physics", "Math", "Informatics", "English"]
    
}

In [30]:
df = pd.DataFrame(data)

In [31]:
df

     Name  Age      Subject
0  Sabine   22      Physics
1   Peter   16         Math
2    Lars   21  Informatics
3   Jules   18      English